Revit 2026 API

# TextElementVerticalAlignment Property

---

Vertical alignment of the text.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public VerticalTextAlignment VerticalAlignment { get; set; }
```
```vb
Public Property VerticalAlignment As VerticalTextAlignment
	Get
	Set
```
```cpp
public:
property VerticalTextAlignment VerticalAlignment {
	VerticalTextAlignment get ();
	void set (VerticalTextAlignment value);
}
```
```fsharp
member VerticalAlignment : VerticalTextAlignment with get, set
```

#### Property Value

VerticalTextAlignment

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

The vertical alignment determines the way text is positioned as the text height changes.

  * For Top-aligned text the top of the text will remain in place.
  * For Middle-aligned text the horizontal center line of the text will remain in place.
  * For Bottom-aligned text the bottom of the text will remain in place.

Changing this property will not affect the position of the text element.

#### Reference

TextElement Class

Autodesk.Revit.DB Namespace